{
  "title": "Política de Privacidad",
  "lastUpdated": "Última actualización: febrero de 2026",
  "intro": "Esta Política de Privacidad explica cómo recopilamos, utilizamos, almacenamos y protegemos tus datos personales cuando utilizas este sitio web y envías tu confirmación de asistencia (RSVP). Nos comprometemos a gestionar tu información de forma responsable y en pleno cumplimiento del Reglamento General de Protección de Datos (UE) 2016/679 (RGPD) y la legislación española aplicable en materia de protección de datos, incluida la Ley Orgánica 3/2018 de Protección de Datos Personales y garantía de los derechos digitales (LOPDGDD).",

  "sections": {
    "controller": {
      "title": "1. Responsable del Tratamiento",
      "body": "El responsable del tratamiento de tus datos personales es la pareja organizadora de esta boda. Al tratarse de un sitio web de evento privado y no de una entidad comercial, no se aplican datos de registro mercantil. Si deseas ponerte en contacto con nosotros en relación con tus datos, puedes hacerlo a través de los datos de contacto proporcionados en este sitio web. Asumimos plena responsabilidad de garantizar que tus datos sean tratados de conformidad con esta política y la legislación aplicable."
    },
    "whatWeCollect": {
      "title": "2. Qué Datos Personales Recopilamos",
      "body": "A través del formulario de RSVP de este sitio web, recopilamos las siguientes categorías de datos personales: tu dirección de correo electrónico; tu estado de asistencia; el nombre y apellidos tuyos y de tus acompañantes; requisitos dietéticos, alergias alimentarias o intolerancias tuyas y de tus invitados; cualquier mensaje opcional que decidas dejarnos; y las peticiones musicales que envíes. No recopilamos datos de categorías especiales más allá de la información dietética, que puede revelar de forma incidental información relacionada con la salud. No recopilamos información de pago, documentos de identidad gubernamentales ni ningún dato no relacionado con la organización de este evento."
    },
    "howWeUse": {
      "title": "3. Cómo Utilizamos tus Datos",
      "body": "Tus datos personales se utilizan exclusivamente para los siguientes fines: gestionar la asistencia de los invitados y la distribución de asientos en nuestra boda; comunicarte información relevante sobre el evento si fuera necesario; trasladar la información dietética y de alergias a nuestro equipo de catering para garantizar una alimentación adecuada; trasladar las peticiones musicales a nuestro DJ o banda para su consideración; y mantener una lista de invitados precisa con fines logísticos y de seguridad. No utilizaremos tus datos para marketing, elaboración de perfiles, toma de decisiones automatizada ni para ningún fin ajeno a la organización directa de este evento."
    },
    "legalBasis": {
      "title": "4. Base Legal del Tratamiento",
      "body": "En virtud del RGPD, tratamos tus datos personales sobre las siguientes bases legales: Consentimiento (artículo 6.1.a) — proporcionas tus datos de forma voluntaria al enviar el formulario de RSVP, y al aceptar nuestros Términos y Condiciones otorgas tu consentimiento explícito para el tratamiento descrito en esta política. Interés legítimo (artículo 6.1.f) — determinadas actividades de tratamiento, como el mantenimiento de una lista de invitados con fines de seguridad y logística, se basan en nuestro interés legítimo de organizar un evento privado seguro y bien gestionado. Cuando tratamos información dietética que pueda constituir datos relacionados con la salud en virtud del artículo 9 del RGPD, nos basamos en tu consentimiento explícito otorgado en el momento del envío. Tienes derecho a retirar tu consentimiento en cualquier momento poniéndote en contacto con nosotros directamente, sin que ello afecte a la licitud del tratamiento llevado a cabo con anterioridad a dicha retirada."
    },
    "sharing": {
      "title": "5. Con Quién Compartimos tus Datos",
      "body": "Tus datos personales solo se compartirán con las siguientes partes, estrictamente en función de la necesidad de conocerlos: nuestro equipo de catering o el local, que recibirá la información dietética, de alergias y el número de invitados; nuestro DJ o banda, que recibirá únicamente las peticiones musicales (sin información personal identificativa); y cualquier proveedor de servicios esencial implicado en la organización del evento que requiera información limitada para cumplir con su función. No vendemos, alquilamos ni compartimos de ningún otro modo tus datos con terceros con fines comerciales o de marketing. Los terceros con quienes compartamos datos recibirán instrucciones de utilizarlos únicamente para los fines descritos anteriormente y de eliminarlos una vez que ya no sean necesarios."
    },
    "retention": {
      "title": "6. Cuánto Tiempo Conservamos tus Datos",
      "body": "Conservaremos tus datos personales únicamente durante el tiempo necesario para organizar y gestionar el evento de la boda. En la práctica, esto significa que tus datos se mantendrán desde el momento del envío hasta un período razonable tras la celebración de la boda — normalmente no más de seis meses después de la fecha del evento — tras lo cual serán eliminados de forma segura. Si solicitas la eliminación de tus datos antes de este período, cumpliremos con tu solicitud tan pronto como sea razonablemente posible, siempre que ello no comprometa nuestra capacidad de gestionar el evento con seguridad."
    },
    "security": {
      "title": "7. Seguridad de los Datos",
      "body": "Adoptamos las medidas técnicas y organizativas adecuadas para proteger tus datos personales frente a accesos no autorizados, pérdidas o divulgaciones. Este sitio web utiliza cifrado HTTPS para toda transmisión de datos. Los envíos del formulario de RSVP se transmiten a través de un servicio de correo electrónico de terceros (EmailJS) y están sujetos a las medidas de seguridad de dicho proveedor. Te recomendamos que consultes la política de privacidad de EmailJS para obtener más detalles. No almacenamos tus datos de RSVP en ninguna base de datos de acceso público. Aunque tomamos precauciones razonables, ningún método de transmisión o almacenamiento electrónico es completamente seguro, y no podemos garantizar una seguridad absoluta."
    },
    "rights": {
      "title": "8. Tus Derechos en Virtud del RGPD",
      "body": "Como interesado en virtud del RGPD, tienes los siguientes derechos en relación con tus datos personales: derecho de acceso — puedes solicitar una copia de los datos personales que conservamos sobre ti; derecho de rectificación — puedes pedirnos que corrijamos cualquier dato inexacto o incompleto; derecho de supresión — puedes solicitar que eliminemos tus datos personales, sujeto a cualquier obligación legal prevalente; derecho a la limitación del tratamiento — puedes pedirnos que restrinjamos el uso que hacemos de tus datos en determinadas circunstancias; derecho a la portabilidad de los datos — puedes solicitar tus datos en un formato estructurado y de uso común; derecho de oposición — puedes oponerte al tratamiento basado en intereses legítimos; y derecho a retirar el consentimiento — cuando el tratamiento se base en el consentimiento, puedes retirarlo en cualquier momento. Para ejercer cualquiera de estos derechos, por favor contáctanos directamente utilizando la información de contacto de este sitio web. Responderemos a todas las solicitudes en el plazo de un mes, tal y como exige el RGPD. Si consideras que tus derechos han sido vulnerados, tienes derecho a presentar una reclamación ante la Agencia Española de Protección de Datos (AEPD) en www.aepd.es."
    },
    "cookies": {
      "title": "9. Cookies y Análisis",
      "body": "Este sitio web puede utilizar cookies u otras tecnologías de seguimiento similares con el fin de comprender cómo los visitantes utilizan el sitio (analítica). Los datos analíticos recopilados son agregados y anonimizados, y no están vinculados a tu envío de RSVP ni a tu identidad personal. No utilizamos cookies publicitarias ni seguimiento de terceros con fines comerciales. Al seguir utilizando este sitio web, consientes el uso de cookies esenciales y analíticas tal como se describe. Puedes desactivar las cookies a través de la configuración de tu navegador en cualquier momento, aunque esto puede afectar a la funcionalidad del sitio."
    },
    "thirdParty": {
      "title": "10. Servicios de Terceros",
      "body": "Este sitio web hace uso de los siguientes servicios de terceros que pueden procesar determinados datos como parte de su funcionamiento: EmailJS, utilizado para transmitir los envíos del formulario de RSVP; Google reCAPTCHA, utilizado para verificar que los envíos de formularios son realizados por personas y no por bots automatizados — este servicio está sujeto a la Política de Privacidad y a los Términos de Servicio de Google; y Google Analytics o equivalente, si está activado, utilizado para recopilar estadísticas de uso anonimizadas. Te animamos a revisar de forma independiente las políticas de privacidad de estos proveedores externos. No somos responsables de las prácticas de datos de los servicios externos."
    },
    "international": {
      "title": "11. Transferencias Internacionales de Datos",
      "body": "Algunos de los servicios de terceros que utilizamos pueden procesar datos fuera del Espacio Económico Europeo (EEE). Cuando esto ocurre, nos aseguramos de que existan las salvaguardias adecuadas de conformidad con los requisitos del RGPD, como el uso de Cláusulas Contractuales Tipo aprobadas por la Comisión Europea o el recurso a una decisión de adecuación. Si tienes alguna preocupación sobre las transferencias internacionales de tus datos, por favor contáctanos."
    },
    "changes": {
      "title": "12. Cambios en esta Política de Privacidad",
      "body": "Nos reservamos el derecho de actualizar esta Política de Privacidad de vez en cuando para reflejar cambios en nuestras prácticas o en la legislación aplicable. Cualquier actualización se publicará en esta página con una fecha revisada. Te animamos a revisar esta política periódicamente. El uso continuado de este sitio web tras la publicación de los cambios constituye tu aceptación de la política actualizada."
    },
    "contact": {
      "title": "13. Contacto",
      "body": "Si tienes alguna pregunta, inquietud o solicitud relacionada con esta Política de Privacidad o el tratamiento de tus datos personales, por favor contáctanos directamente utilizando los datos de contacto proporcionados en este sitio web. Nos comprometemos a atender tus consultas de forma rápida y transparente."
    }
  }
}
